# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] #4
  # - [-1, 1, kmscm, [512,32,4,6]] # 5
  - [-1, 1, DKCA, [512]]

  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]] # 7
  # - [-1, 1, kmscm, [512,32,4,6]] # 8
  - [-1, 1, DKCA, [512]]

  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]] # 10

  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 2, C2PSA, [1024]] # 12
# improved_v11

# YOLO11n head
head:
  # -------------------------
  # Top-Down FPN: P5 -> P4
  # backbone P4: layer 8 (DKCA, stride16, ~128c for n)
  # backbone P5: layer 12 (C2PSA, stride32, ~256c for n)
  # -------------------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]               # 13: P5 -> P4
  - [[-1, 8], 1, dwt_concat, [1]]              # 14: align P4(128)->P5up(256), fuse then cat
  - [-1, 2, C3k2, [512, False]]                              # 15: P4_fused (nominal 512, ~128c)

  # -------------------------
  # Top-Down FPN: P4 -> P3
  # backbone P3: layer 5 (DKCA, stride8, ~128c for n)
  # -------------------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]               # 16: P4 -> P3
  - [[-1, 5], 1, dwt_concat, [1]]              # 17: align P3(128)->P3up(128)
  - [-1, 2, C3k2, [256, False]]                              # 18: P3_fused (nominal 256, ~64c)

 
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]               # 19: P3 -> P2
  - [[-1, 2], 1, dwt_concat, [1]]                # 20: fuse P2_backbone(64) with P2_up(64)
  - [-1, 2, C3k2, [128, False]]                              # 21: P2_out (nominal 128, ~32c)
  # -------------------------
  # Bottom-Up PAN: P2 -> P3
  # -------------------------
  - [-1, 1, Conv, [128, 3, 2]]                               # 22: down to P3 (nominal 128, ~32c)
  - [[-1, 18], 1, dwt_concat, [1]]               # 23: fuse with P3_fused (~64c), align (32->64)
  - [-1, 2, C3k2, [256, False]]                              # 24: P3_out (nominal 256, ~64c)

  # -------------------------
  # Bottom-Up PAN: P3 -> P4
  # -------------------------
  - [-1, 1, Conv, [256, 3, 2]]                               # 25: down to P4 (nominal 256, ~64c)
  - [[-1, 15,21], 1, ASFF3, [512, 4]]              # 26: fuse with P4_fused (~128c), align (64->128)
  - [-1, 2, C3k2, [512, False]]                              # 27: P4_out (nominal 512, ~128c)

  # -------------------------
  # Bottom-Up PAN: P4 -> P5
  # -------------------------
  - [-1, 1, Conv, [512, 3, 2]]                               # 28: down to P5 (nominal 512, ~128c)
  - [[-1, 12,21], 1, ASFF3, [1024, 8]]             # 29: fuse with backbone P5 (~256c)
  - [-1, 2, C3k2, [1024, True]]                              # 30: P5_out (nominal 1024, ~256c)【】

  # -------------------------
  # ✅ Morphology attention (apply on P3_out and P4_out)
  # Note: your moratt returns x + res (res is [B,C,1,1] broadcast), so it's safe.
  # -------------------------
  - [24, 1, moratt, [256, 1]]                          # 31: moratt on P3_out
  - [27, 1, moratt, [512, 1]]                          # 32: moratt on P4_out
  - [21, 1, DoGGradEnhance, [128, 5, 1.0, 2.0, 1.0]]
  # ✅ Detect with 4 scales: P2_out, P3_out(mor), P4_out(mor), P5_out
  # -------------------------
  - [[33, 31, 32, 30], 1, Detect, [nc]]                      # 33 Detect(P2,P3,P4,P5)